mfkiwl/McuDevelop/Devices/STM32F7/include/stm32f7Rcc.h
/*
 * Copyright (c) 2019 zhtlab
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to permit
 * persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#ifndef _STM32F7RCC_H_
#define _STM32F7RCC_H_

/* STM32F730 reference manual  DocID RM0431 Rev 3 */

#define RCC_CLOCK_HPRETABLE     {0, 0, 0, 0,  0, 0, 0, 0,  1, 2, 3, 4,  6, 7, 8, 9}
#define RCC_CLOCK_PPRETABLE     {0, 0, 0, 0,  1, 2, 3, 4}
typedef struct {
  __IO uint32_t         CR;             /* 0x00 */
#define RCC_CR_PLLSAIRDY_SHIFT          29
#define RCC_CR_PLLSAIRDY_MASK           (1 << (RCC_CR_PLLSAIRDY_SHIFT))
#define RCC_CR_PLLSAIRDY_NO             (0 << (RCC_CR_PLLSAIRDY_SHIFT))
#define RCC_CR_PLLSAIRDY_YES		(1 << (RCC_CR_PLLSAIRDY_SHIFT))
#define RCC_CR_PLLSAION_SHIFT           28
#define RCC_CR_PLLSAION_MASK            (1 << (RCC_CR_PLLSAION_SHIFT))
#define RCC_CR_PLLSAION_NO              (0 << (RCC_CR_PLLSAION_SHIFT))
#define RCC_CR_PLLSAION_YES		(1 << (RCC_CR_PLLSAION_SHIFT))
#define RCC_CR_PLLI2SRDY_SHIFT          27
#define RCC_CR_PLLI2SRDY_MASK           (1 << (RCC_CR_PLLI2SRDY_SHIFT))
#define RCC_CR_PLLI2SRDY_NO             (0 << (RCC_CR_PLLI2SRDY_SHIFT))
#define RCC_CR_PLLI2SRDY_YES		(1 << (RCC_CR_PLLI2SRDY_SHIFT))
#define RCC_CR_PLLI2SON_SHIFT		26
#define RCC_CR_PLLI2SON_MASK		(1 << (RCC_CR_PLLI2SON_SHIFT))
#define RCC_CR_PLLI2SON_NO		(0 << (RCC_CR_PLLI2SON_SHIFT))
#define RCC_CR_PLLI2SON_YES		(1 << (RCC_CR_PLLI2SON_SHIFT))
#define RCC_CR_PLLRDY_SHIFT		25
#define RCC_CR_PLLRDY_MASK		(1 << (RCC_CR_PLLRDY_SHIFT))
#define RCC_CR_PLLRDY_NO		(0 << (RCC_CR_PLLRDY_SHIFT))
#define RCC_CR_PLLRDY_YES		(1 << (RCC_CR_PLLRDY_SHIFT))
#define RCC_CR_PLLON_SHIFT		24
#define RCC_CR_PLLON_MASK		(1 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_PLLON_NO                 (0 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_PLLON_YES		(1 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_CSSON_SHIFT		19
#define RCC_CR_CSSON_MASK		(1 << (RCC_CR_CSSON_SHIFT))
#define RCC_CR_CSSON_NO                 (0 << (RCC_CR_CSSON_SHIFT))
#define RCC_CR_CSSON_YES		(1 << (RCC_CR_CSSON_SHIFT))
#define RCC_CR_HSEBYP_SHIFT		18
#define RCC_CR_HSEBYP_MASK		(1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_NO		(0 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_YES		(1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSERDY_SHIFT		17
#define RCC_CR_HSERDY_MASK		(1 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSERDY_NO		(0 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSERDY_YES		(1 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSEON_SHIFT		16
#define RCC_CR_HSEON_MASK		(1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_NO                 (0 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_YES		(1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSIRDY_SHIFT		1
#define RCC_CR_HSIRDY_MASK		(1 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIRDY_NO                (0 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIRDY_YES		(1 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSION_SHIFT		0
#define RCC_CR_HSION_MASK               (1 << (RCC_CR_HSION_SHIFT))
#define RCC_CR_HSION_NO                 (0 << (RCC_CR_HSION_SHIFT))
#define RCC_CR_HSION_YES                (1 << (RCC_CR_HSION_SHIFT))

  __IO uint32_t         PLLCFGR;        /* 0x04 */
#define RCC_PLLCFGR_PLLQ_SHIFT          24
#define RCC_PLLCFGR_PLLQ_MASK           (15 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQ_DIV2           ( 2 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQ_DIV3           ( 3 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQ_DIV(x)         (((x) << (RCC_PLLCFGR_PLLQ_SHIFT)) & RCC_PLLCFGR_PLLQ_MASK)

#define RCC_PLLCFGR_PLLSRC_SHIFT	22
#define RCC_PLLCFGR_PLLSRC_MASK		(1 << (RCC_PLLCFGR_PLLSRC_SHIFT))
#define RCC_PLLCFGR_PLLSRC_HSI16        (0 << (RCC_PLLCFGR_PLLSRC_SHIFT))
#define RCC_PLLCFGR_PLLSRC_HSE          (1 << (RCC_PLLCFGR_PLLSRC_SHIFT))
#define RCC_PLLCFGR_PLLP_SHIFT		16
#define RCC_PLLCFGR_PLLP_MASK		(3 << (RCC_PLLCFGR_PLLP_SHIFT))
#define RCC_PLLCFGR_PLLP_DIV2		(0 << (RCC_PLLCFGR_PLLP_SHIFT))
#define RCC_PLLCFGR_PLLP_DIV4		(1 << (RCC_PLLCFGR_PLLP_SHIFT))
#define RCC_PLLCFGR_PLLP_DIV6		(2 << (RCC_PLLCFGR_PLLP_SHIFT))
#define RCC_PLLCFGR_PLLP_DIV8		(3 << (RCC_PLLCFGR_PLLP_SHIFT))

#define RCC_PLLCFGR_PLLN_SHIFT		6
#define RCC_PLLCFGR_PLLN_MASK		(0x1ff << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MULX(x)	(((x) & 0x1ff) << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL0_XXX	(0 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL1_XXX	(2 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL49_XXX	(49 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL50		(50 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL51		(51 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL432		(432 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL433_XXX     (433 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL511_XXX     (511 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLM_SHIFT		0
#define RCC_PLLCFGR_PLLM_MASK		(0x3f << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV2		(2 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV3		(3 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV63		(63 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV(x)		(((x) << (RCC_PLLCFGR_PLLM_SHIFT)) & RCC_PLLCFGR_PLLM_MASK)

  __IO uint32_t         CFGR;           /* 0x08 */
#define RCC_CFGR_MCO2SEL_SHIFT		30
#define RCC_CFGR_MCO2SEL_MASK		(3 << (RCC_CFGR_MCO2SEL_SHIFT))
#define RCC_CFGR_MCO2SEL_SYSCLK		(0 << (RCC_CFGR_MCO2SEL_SHIFT))
#define RCC_CFGR_MCO2SEL_PLLI2S		(1 << (RCC_CFGR_MCO2SEL_SHIFT))
#define RCC_CFGR_MCO2SEL_HSE		(2 << (RCC_CFGR_MCO2SEL_SHIFT))
#define RCC_CFGR_MCO2SEL_PLL		(3 << (RCC_CFGR_MCO2SEL_SHIFT))
#define RCC_CFGR_MCO2PRE_SHIFT          27
#define RCC_CFGR_MCO2PRE_MASK           (7 << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV1           (0 << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV2           (4 << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV3           (5 << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV4		(6 << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO2PRE_DIV5		(7 << (RCC_CFGR_MCO2PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_SHIFT          24
#define RCC_CFGR_MCO1PRE_MASK           (7 << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV1           (0 << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV2           (4 << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV3           (5 << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV4		(6 << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1PRE_DIV5		(7 << (RCC_CFGR_MCO1PRE_SHIFT))
#define RCC_CFGR_MCO1SEL_SHIFT		21
#define RCC_CFGR_MCO1SEL_MASK		(3 << (RCC_CFGR_MCO1SEL_SHIFT))
#define RCC_CFGR_MCO1SEL_HSI		(0 << (RCC_CFGR_MCO1SEL_SHIFT))
#define RCC_CFGR_MCO1SEL_LSE		(1 << (RCC_CFGR_MCO1SEL_SHIFT))
#define RCC_CFGR_MCO1SEL_HSE		(2 << (RCC_CFGR_MCO1SEL_SHIFT))
#define RCC_CFGR_MCO1SEL_PLL		(3 << (RCC_CFGR_MCO1SEL_SHIFT))

