mfkiwl/McuDevelop/Devices/STM32F7/include/stm32f7Rcc.h
#define RCC_CFGR_PPRE2_SHIFT		13		/* APB2 */
#define RCC_CFGR_PPRE2_MASK		(7 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV1		(0 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV2		(4 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV4		(5 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV8		(6 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV16		(7 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE1_SHIFT		10		/* APB1 */
#define RCC_CFGR_PPRE1_MASK		(7 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV1		(0 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV2		(4 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV4		(5 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV8		(6 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV16		(7 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_HPRE_SHIFT             4               /* AHB */
#define RCC_CFGR_HPRE_MASK		(0xf << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV1		(0 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV2		(8 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV4		(9 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV8		(10 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV16             (11 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV64             (12 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV128            (13 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV256            (14 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV512            (15 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_SWS_SHIFT              2
#define RCC_CFGR_SWS_MASK               (3 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSI                (0 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSE                (1 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_PLL                (2 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_NA                 (3 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SW_SHIFT               0
#define RCC_CFGR_SW_MASK                (3 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_HSI                 (0 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_HSE                 (1 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_PLL                 (2 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_NA                  (3 << (RCC_CFGR_SW_SHIFT))

  __IO uint32_t         CIR;           /* 0x0c */
#define RCC_CICR_CSSC_SHIFT		23
#define RCC_CICR_CSSC_MASK		(1 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_CSSC_NO		(0 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_CSSC_YES		(1 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_PLLI2S_RDYC_SHIFT	21
#define RCC_CICR_PLLI2S_RDYC_MASK	(1 << (RCC_CICR_PLLI2S_RDYC_SHIFT))
#define RCC_CICR_PLLI2S_RDYC_NO         (0 << (RCC_CICR_PLLI2S_RDYC_SHIFT))
#define RCC_CICR_PLLI2S_RDYC_YES	(1 << (RCC_CICR_PLLI2S_RDYC_SHIFT))
#define RCC_CICR_PLL_RDYC_SHIFT		20
#define RCC_CICR_PLL_RDYC_MASK		(1 << (RCC_CICR_PLL_RDYC_SHIFT))
#define RCC_CICR_PLL_RDYC_NO		(0 << (RCC_CICR_PLL_RDYC_SHIFT))
#define RCC_CICR_PLL_RDYC_YES		(1 << (RCC_CICR_PLL_RDYC_SHIFT))
#define RCC_CICR_HSE_RDYC_SHIFT		19
#define RCC_CICR_HSE_RDYC_MASK		(1 << (RCC_CICR_HSE_RDYC_SHIFT))
#define RCC_CICR_HSE_RDYC_NO		(0 << (RCC_CICR_HSE_RDYC_SHIFT))
#define RCC_CICR_HSE_RDYC_YES		(1 << (RCC_CICR_HSE_RDYC_SHIFT))
#define RCC_CICR_HSI_RDYC_SHIFT		18
#define RCC_CICR_HSI_RDYC_MASK		(1 << (RCC_CICR_HSI_RDYC_SHIFT))
#define RCC_CICR_HSI_RDYC_NO		(0 << (RCC_CICR_HSI_RDYC_SHIFT))
#define RCC_CICR_HSI_RDYC_YES		(1 << (RCC_CICR_HSI_RDYC_SHIFT))
#define RCC_CICR_LSE_RDYC_SHIFT		17
#define RCC_CICR_LSE_RDYC_MASK		(1 << (RCC_CICR_LSE_RDYC_SHIFT))
#define RCC_CICR_LSE_RDYC_NO		(0 << (RCC_CICR_LSE_RDYC_SHIFT))
#define RCC_CICR_LSE_RDYC_YES		(1 << (RCC_CICR_LSE_RDYC_SHIFT))
#define RCC_CICR_LSI_RDYC_SHIFT		16
#define RCC_CICR_LSI_RDYC_MASK		(1 << (RCC_CICR_LSI_RDYC_SHIFT))
#define RCC_CICR_LSI_RDYC_NO		(0 << (RCC_CICR_LSI_RDYC_SHIFT))
#define RCC_CICR_LSI_RDYC_YES		(1 << (RCC_CICR_LSI_RDYC_SHIFT))
#define RCC_CIER_PLLI2S_RDYIE_SHIFT	13
#define RCC_CIER_PLLI2S_RDYIE_MASK	(1 << (RCC_CIER_PLLI2S_RDYIE_SHIFT))
#define RCC_CIER_PLLI2S_RDYIE_NO	(0 << (RCC_CIER_PLLI2S_RDYIE_SHIFT))
#define RCC_CIER_PLLI2S_RDYIE_YES	(1 << (RCC_CIER_PLLI2S_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_SHIFT	12
#define RCC_CIER_PLL_RDYIE_MASK		(1 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_NO		(0 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_YES		(1 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_SHIFT	11
#define RCC_CIER_HSE_RDYIE_MASK		(1 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_NO		(0 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_YES		(1 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSI_RDYIE_SHIFT	10
#define RCC_CIER_HSI_RDYIE_MASK		(1 << (RCC_CIER_HSI_RDYIE_SHIFT))
#define RCC_CIER_HSI_RDYIE_NO		(0 << (RCC_CIER_HSI_RDYIE_SHIFT))
#define RCC_CIER_HSI_RDYIE_YES		(1 << (RCC_CIER_HSI_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_SHIFT	9
#define RCC_CIER_LSE_RDYIE_MASK		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_NO		(0 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_YES		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_SHIFT	8
#define RCC_CIER_LSI_RDYIE_MASK		(1 << (RCC_CIER_LSI_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_NO		(0 << (RCC_CIER_LSI_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_YES		(1 << (RCC_CIER_LSI_RDYIE_SHIFT))
#define RCC_CIFR_CSSF_SHIFT		7
#define RCC_CIFR_CSSF_MASK		(1 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_CSSF_NO		(0 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_CSSF_YES		(1 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_PLLI2S_RDYF_SHIFT	6
#define RCC_CIFR_PLLI2S_RDYF_MASK	(1 << (RCC_CIFR_PLLI2S_RDYF_SHIFT))
#define RCC_CIFR_PLLI2S_RDYF_NO         (0 << (RCC_CIFR_PLLI2S_RDYF_SHIFT))
#define RCC_CIFR_PLLI2S_RDYF_YES	(1 << (RCC_CIFR_PLLI2S_RDYF_SHIFT))
#define RCC_CIFR_PLL_RDYF_SHIFT		5
#define RCC_CIFR_PLL_RDYF_MASK		(1 << (RCC_CIFR_PLL_RDYF_SHIFT))
#define RCC_CIFR_PLL_RDYF_NO		(0 << (RCC_CIFR_PLL_RDYF_SHIFT))
#define RCC_CIFR_PLL_RDYF_YES		(1 << (RCC_CIFR_PLL_RDYF_SHIFT))
#define RCC_CIFR_HSE_RDYF_SHIFT		4
#define RCC_CIFR_HSE_RDYF_MASK		(1 << (RCC_CIFR_HSE_RDYF_SHIFT))
#define RCC_CIFR_HSE_RDYF_NO		(0 << (RCC_CIFR_HSE_RDYF_SHIFT))
#define RCC_CIFR_HSE_RDYF_YES		(1 << (RCC_CIFR_HSE_RDYF_SHIFT))
#define RCC_CIFR_HSI_RDYF_SHIFT		3
#define RCC_CIFR_HSI_RDYF_MASK		(1 << (RCC_CIFR_HSI_RDYF_SHIFT))
#define RCC_CIFR_HSI_RDYF_NO		(0 << (RCC_CIFR_HSI_RDYF_SHIFT))
#define RCC_CIFR_HSI_RDYF_YES		(1 << (RCC_CIFR_HSI_RDYF_SHIFT))
#define RCC_CIFR_LSE_RDYF_SHIFT		1
#define RCC_CIFR_LSE_RDYF_MASK		(1 << (RCC_CIFR_LSE_RDYF_SHIFT))
#define RCC_CIFR_LSE_RDYF_NO		(0 << (RCC_CIFR_LSE_RDYF_SHIFT))
#define RCC_CIFR_LSE_RDYF_YES		(1 << (RCC_CIFR_LSE_RDYF_SHIFT))
#define RCC_CIFR_LSI_RDYF_SHIFT		0
#define RCC_CIFR_LSI_RDYF_MASK		(1 << (RCC_CIFR_LSI_RDYF_SHIFT))
#define RCC_CIFR_LSI_RDYF_NO		(0 << (RCC_CIFR_LSI_RDYF_SHIFT))
#define RCC_CIFR_LSI_RDYF_YES		(1 << (RCC_CIFR_LSI_RDYF_SHIFT))

  __IO uint32_t         AHB1RSTR;       /* 0x10 */
  __IO uint32_t         AHB2RSTR;       /* 0x14 */
  __IO uint32_t         AHB3RSTR;       /* 0x18 */
  __IO uint32_t         reserved0x1c;   /* 0x1c */

