mfkiwl/McuDevelop/Devices/STM32F7/include/stm32f7Rcc.h
  __IO uint32_t         APB1RSTR;       /* 0x20 */
  __IO uint32_t         APB2RSTR;       /* 0x24 */
  __IO uint32_t         reserved0x24;   /* 0x28 */
  __IO uint32_t         reserved0x2c;   /* 0x2c */

  __IO uint32_t         AHB1ENR;        /* 0x30 */
#define RCC_AHB1ENR_DMA2EN_SHIFT	22
#define RCC_AHB1ENR_DMA2EN_MASK		(1 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_NO		(0 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_YES		(1 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_SHIFT	21
#define RCC_AHB1ENR_DMA1EN_MASK		(1 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_NO		(0 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_YES		(1 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DTCMRAMEN_SHIFT	20
#define RCC_AHB1ENR_DTCMRAMEN_MASK	(1 << (RCC_AHB1ENR_DTCMRAMEN_SHIFT))
#define RCC_AHB1ENR_DTCMRAMEN_NO	(0 << (RCC_AHB1ENR_DTCMRAMEN_SHIFT))
#define RCC_AHB1ENR_DTCMRAMEN_YES	(1 << (RCC_AHB1ENR_DTCMRAMEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_SHIFT		12
#define RCC_AHB1ENR_CRCEN_MASK		(1 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_NO		(0 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_YES		(1 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_FLASHEN_SHIFT	8
#define RCC_AHB1ENR_FLASHEN_MASK	(1 << (RCC_AHB1ENR_FLASHEN_SHIFT))
#define RCC_AHB1ENR_FLASHEN_NO		(0 << (RCC_AHB1ENR_FLASHEN_SHIFT))
#define RCC_AHB1ENR_FLASHEN_YES		(1 << (RCC_AHB1ENR_FLASHEN_SHIFT))
#define RCC_AHB1ENR_GPIOAEN_SHIFT       0
#define RCC_AHB1ENR_GPIOAEN_MASK        (1 << (RCC_AHB1ENR_GPIOAEN_SHIFT))
#define RCC_AHB1ENR_GPIOAEN_NO          (0 << (RCC_AHB1ENR_GPIOAEN_SHIFT))
#define RCC_AHB1ENR_GPIOAEN_YES         (1 << (RCC_AHB1ENR_GPIOAEN_SHIFT))
#define RCC_AHB1ENR_GPIOBEN_SHIFT       1
#define RCC_AHB1ENR_GPIOBEN_MASK        (1 << (RCC_AHB1ENR_GPIOBEN_SHIFT))
#define RCC_AHB1ENR_GPIOBEN_NO          (0 << (RCC_AHB1ENR_GPIOBEN_SHIFT))
#define RCC_AHB1ENR_GPIOBEN_YES         (1 << (RCC_AHB1ENR_GPIOBEN_SHIFT))
#define RCC_AHB1ENR_GPIOCEN_SHIFT       2
#define RCC_AHB1ENR_GPIOCEN_MASK        (1 << (RCC_AHB1ENR_GPIOCEN_SHIFT))
#define RCC_AHB1ENR_GPIOCEN_NO          (0 << (RCC_AHB1ENR_GPIOCEN_SHIFT))
#define RCC_AHB1ENR_GPIOCEN_YES         (1 << (RCC_AHB1ENR_GPIOCEN_SHIFT))
#define RCC_AHB1ENR_GPIODEN_SHIFT       3
#define RCC_AHB1ENR_GPIODEN_MASK        (1 << (RCC_AHB1ENR_GPIODEN_SHIFT))
#define RCC_AHB1ENR_GPIODEN_NO          (0 << (RCC_AHB1ENR_GPIODEN_SHIFT))
#define RCC_AHB1ENR_GPIODEN_YES         (1 << (RCC_AHB1ENR_GPIODEN_SHIFT))
#define RCC_AHB1ENR_GPIOEEN_SHIFT       4
#define RCC_AHB1ENR_GPIOEEN_MASK        (1 << (RCC_AHB1ENR_GPIOEEN_SHIFT))
#define RCC_AHB1ENR_GPIOEEN_NO          (0 << (RCC_AHB1ENR_GPIOEEN_SHIFT))
#define RCC_AHB1ENR_GPIOEEN_YES         (1 << (RCC_AHB1ENR_GPIOEEN_SHIFT))
#define RCC_AHB1ENR_GPIOFEN_SHIFT       5
#define RCC_AHB1ENR_GPIOFEN_MASK        (1 << (RCC_AHB1ENR_GPIOFEN_SHIFT))
#define RCC_AHB1ENR_GPIOFEN_NO          (0 << (RCC_AHB1ENR_GPIOFEN_SHIFT))
#define RCC_AHB1ENR_GPIOFEN_YES         (1 << (RCC_AHB1ENR_GPIOFEN_SHIFT))
#define RCC_AHB1ENR_GPIOGEN_SHIFT       6
#define RCC_AHB1ENR_GPIOGEN_MASK        (1 << (RCC_AHB1ENR_GPIOGEN_SHIFT))
#define RCC_AHB1ENR_GPIOGEN_NO          (0 << (RCC_AHB1ENR_GPIOGEN_SHIFT))
#define RCC_AHB1ENR_GPIOGEN_YES         (1 << (RCC_AHB1ENR_GPIOGEN_SHIFT))
#define RCC_AHB1ENR_GPIOHEN_SHIFT       7
#define RCC_AHB1ENR_GPIOHEN_MASK        (1 << (RCC_AHB1ENR_GPIOHEN_SHIFT))
#define RCC_AHB1ENR_GPIOHEN_NO          (0 << (RCC_AHB1ENR_GPIOHEN_SHIFT))
#define RCC_AHB1ENR_GPIOHEN_YES         (1 << (RCC_AHB1ENR_GPIOHEN_SHIFT))
#define RCC_AHB1ENR_GPIOIEN_SHIFT       8
#define RCC_AHB1ENR_GPIOIEN_MASK        (1 << (RCC_AHB1ENR_GPIOIEN_SHIFT))
#define RCC_AHB1ENR_GPIOIEN_NO          (0 << (RCC_AHB1ENR_GPIOIEN_SHIFT))
#define RCC_AHB1ENR_GPIOIEN_YES         (1 << (RCC_AHB1ENR_GPIOIEN_SHIFT))

#define RCC_GPIOAEN_YES                 (RCC_AHB1ENR_GPIOAEN_YES)
#define RCC_GPIOBEN_YES                 (RCC_AHB1ENR_GPIOBEN_YES)
#define RCC_GPIOCEN_YES                 (RCC_AHB1ENR_GPIOCEN_YES)
#define RCC_GPIODEN_YES                 (RCC_AHB1ENR_GPIODEN_YES)
#define RCC_GPIOEEN_YES                 (RCC_AHB1ENR_GPIOEEN_YES)
#define RCC_GPIOFEN_YES                 (RCC_AHB1ENR_GPIOFEN_YES)
#define RCC_GPIOGEN_YES                 (RCC_AHB1ENR_GPIOGEN_YES)
#define RCC_GPIOHEN_YES                 (RCC_AHB1ENR_GPIOHEN_YES)
#define RCC_GPIOIEN_YES                 (RCC_AHB1ENR_GPIOIEN_YES)

  __IO uint32_t         AHB2ENR;        /* 0x34 */
#define RCC_AHB2ENR_OTGEN_SHIFT         22
#define RCC_AHB2ENR_OTGEN_MASK		(1 << (RCC_AHB2ENR_OTGEN_SHIFT))
#define RCC_AHB2ENR_OTGEN_NO		(0 << (RCC_AHB2ENR_OTGEN_SHIFT))
#define RCC_AHB2ENR_OTGEN_YES		(1 << (RCC_AHB2ENR_OTGEN_SHIFT))

  __IO uint32_t         AHB3ENR;        /* 0x38 */
  __IO uint32_t         reserved0x3c;   /* 0x3c */

  __IO uint32_t         APB1ENR;        /* 0x40 */
#define RCC_APB1ENR_PWREN_SHIFT	28
#define RCC_APB1ENR_PWREN_MASK		(1 << (RCC_APB1ENR_PWREN_SHIFT))
#define RCC_APB1ENR_PWREN_NO		(0 << (RCC_APB1ENR_PWREN_SHIFT))
#define RCC_APB1ENR_PWREN_YES		(1 << (RCC_APB1ENR_PWREN_SHIFT))
#define RCC_APB1ENR_I2C3EN_SHIFT	23
#define RCC_APB1ENR_I2C3EN_MASK	(1 << (RCC_APB1ENR_I2C3EN_SHIFT))
#define RCC_APB1ENR_I2C3EN_NO		(0 << (RCC_APB1ENR_I2C3EN_SHIFT))
#define RCC_APB1ENR_I2C3EN_YES		(1 << (RCC_APB1ENR_I2C3EN_SHIFT))
#define RCC_APB1ENR_I2C2EN_SHIFT	22
#define RCC_APB1ENR_I2C2EN_MASK	(1 << (RCC_APB1ENR_I2C2EN_SHIFT))
#define RCC_APB1ENR_I2C2EN_NO		(0 << (RCC_APB1ENR_I2C2EN_SHIFT))
#define RCC_APB1ENR_I2C2EN_YES		(1 << (RCC_APB1ENR_I2C2EN_SHIFT))
#define RCC_APB1ENR_I2C1EN_SHIFT	21
#define RCC_APB1ENR_I2C1EN_MASK	(1 << (RCC_APB1ENR_I2C1EN_SHIFT))
#define RCC_APB1ENR_I2C1EN_NO		(0 << (RCC_APB1ENR_I2C1EN_SHIFT))
#define RCC_APB1ENR_I2C1EN_YES		(1 << (RCC_APB1ENR_I2C1EN_SHIFT))
#define RCC_APB1ENR_USART2EN_SHIFT	17
#define RCC_APB1ENR_USART2EN_MASK	(1 << (RCC_APB1ENR_USART2EN_SHIFT))
#define RCC_APB1ENR_USART2EN_NO	(0 << (RCC_APB1ENR_USART2EN_SHIFT))
#define RCC_APB1ENR_USART2EN_YES	(1 << (RCC_APB1ENR_USART2EN_SHIFT))
#define RCC_APB1ENR_SPI3EN_SHIFT	15
#define RCC_APB1ENR_SPI3EN_MASK	(1 << (RCC_APB1ENR_SPI3EN_SHIFT))
#define RCC_APB1ENR_SPI3EN_NO		(0 << (RCC_APB1ENR_SPI3EN_SHIFT))
#define RCC_APB1ENR_SPI3EN_YES		(1 << (RCC_APB1ENR_SPI3EN_SHIFT))
#define RCC_APB1ENR_SPI2EN_SHIFT	14
#define RCC_APB1ENR_SPI2EN_MASK	(1 << (RCC_APB1ENR_SPI2EN_SHIFT))
#define RCC_APB1ENR_SPI2EN_NO		(0 << (RCC_APB1ENR_SPI2EN_SHIFT))
#define RCC_APB1ENR_SPI2EN_YES		(1 << (RCC_APB1ENR_SPI2EN_SHIFT))
#define RCC_APB1ENR_WWDGEN_SHIFT	11
#define RCC_APB1ENR_WWDGEN_MASK	(1 << (RCC_APB1ENR_WWDGEN_SHIFT))
#define RCC_APB1ENR_WWDGEN_NO		(0 << (RCC_APB1ENR_WWDGEN_SHIFT))
#define RCC_APB1ENR_WWDGEN_YES		(1 << (RCC_APB1ENR_WWDGEN_SHIFT))
#define RCC_APB1ENR_TIM5EN_SHIFT	3
#define RCC_APB1ENR_TIM5EN_MASK	(1 << (RCC_APB1ENR_TIM5EN_SHIFT))
#define RCC_APB1ENR_TIM5EN_NO		(0 << (RCC_APB1ENR_TIM5EN_SHIFT))
#define RCC_APB1ENR_TIM5EN_YES		(1 << (RCC_APB1ENR_TIM5EN_SHIFT))
#define RCC_APB1ENR_TIM4EN_SHIFT	2
#define RCC_APB1ENR_TIM4EN_MASK	(1 << (RCC_APB1ENR_TIM4EN_SHIFT))
#define RCC_APB1ENR_TIM4EN_NO		(0 << (RCC_APB1ENR_TIM4EN_SHIFT))
#define RCC_APB1ENR_TIM4EN_YES		(1 << (RCC_APB1ENR_TIM4EN_SHIFT))
#define RCC_APB1ENR_TIM3EN_SHIFT	1
#define RCC_APB1ENR_TIM3EN_MASK	(1 << (RCC_APB1ENR_TIM3EN_SHIFT))
#define RCC_APB1ENR_TIM3EN_NO		(0 << (RCC_APB1ENR_TIM3EN_SHIFT))
#define RCC_APB1ENR_TIM3EN_YES		(1 << (RCC_APB1ENR_TIM3EN_SHIFT))
#define RCC_APB1ENR_TIM2EN_SHIFT	0
#define RCC_APB1ENR_TIM2EN_MASK	(1 << (RCC_APB1ENR_TIM2EN_SHIFT))
#define RCC_APB1ENR_TIM2EN_NO		(0 << (RCC_APB1ENR_TIM2EN_SHIFT))
#define RCC_APB1ENR_TIM2EN_YES		(1 << (RCC_APB1ENR_TIM2EN_SHIFT))

  __IO uint32_t         APB2ENR;        /* 0x44 */
#define RCC_APB2ENR_TIM11EN_SHIFT	18
#define RCC_APB2ENR_TIM11EN_MASK	(1 << (RCC_APB2ENR_TIM11EN_SHIFT))
#define RCC_APB2ENR_TIM11EN_NO		(0 << (RCC_APB2ENR_TIM11EN_SHIFT))
#define RCC_APB2ENR_TIM11EN_YES		(1 << (RCC_APB2ENR_TIM11EN_SHIFT))
#define RCC_APB2ENR_TIM10EN_SHIFT	17
#define RCC_APB2ENR_TIM10EN_MASK	(1 << (RCC_APB2ENR_TIM10EN_SHIFT))
#define RCC_APB2ENR_TIM10EN_NO		(0 << (RCC_APB2ENR_TIM10EN_SHIFT))
#define RCC_APB2ENR_TIM10EN_YES		(1 << (RCC_APB2ENR_TIM10EN_SHIFT))
#define RCC_APB2ENR_TIM9EN_SHIFT	16
#define RCC_APB2ENR_TIM9EN_MASK         (1 << (RCC_APB2ENR_TIM9EN_SHIFT))
#define RCC_APB2ENR_TIM9EN_NO		(0 << (RCC_APB2ENR_TIM9EN_SHIFT))
#define RCC_APB2ENR_TIM9EN_YES		(1 << (RCC_APB2ENR_TIM9EN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_SHIFT	14
#define RCC_APB2ENR_SYSCFGEN_MASK	(1 << (RCC_APB2ENR_SYSCFGEN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_NO		(0 << (RCC_APB2ENR_SYSCFGEN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_YES	(1 << (RCC_APB2ENR_SYSCFGEN_SHIFT))
#define RCC_APB2ENR_SPI4EN_SHIFT	13
#define RCC_APB2ENR_SPI4EN_MASK		(1 << (RCC_APB2ENR_SPI4EN_SHIFT))
#define RCC_APB2ENR_SPI4EN_NO		(0 << (RCC_APB2ENR_SPI4EN_SHIFT))
#define RCC_APB2ENR_SPI4EN_YES		(1 << (RCC_APB2ENR_SPI4EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_SHIFT	12
#define RCC_APB2ENR_SPI1EN_MASK		(1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_NO		(0 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_YES		(1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SDIOEN_SHIFT	11
#define RCC_APB2ENR_SDIOEN_MASK         (1 << (RCC_APB2ENR_SDIOEN_SHIFT))
#define RCC_APB2ENR_SDIOEN_NO		(0 << (RCC_APB2ENR_SDIOEN_SHIFT))
#define RCC_APB2ENR_SDIOEN_YES          (1 << (RCC_APB2ENR_SDIOEN_SHIFT))
#define RCC_APB2ENR_USART6EN_SHIFT	5
#define RCC_APB2ENR_USART6EN_MASK	(1 << (RCC_APB2ENR_USART6EN_SHIFT))
#define RCC_APB2ENR_USART6EN_NO		(0 << (RCC_APB2ENR_USART6EN_SHIFT))
#define RCC_APB2ENR_USART6EN_YES	(1 << (RCC_APB2ENR_USART6EN_SHIFT))
#define RCC_APB2ENR_USART1EN_SHIFT	4
#define RCC_APB2ENR_USART1EN_MASK	(1 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_USART1EN_NO		(0 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_USART1EN_YES	(1 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_SHIFT	0
#define RCC_APB2ENR_TIM1EN_MASK         (1 << (RCC_APB2ENR_TIM1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_NO		(0 << (RCC_APB2ENR_TIM1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_YES		(1 << (RCC_APB2ENR_TIM1EN_SHIFT))

  uint32_t              reserved0x48;   /* 0x48 */
  uint32_t              reserved0x4c;   /* 0x4c */

  __IO uint32_t         AHB1LPENR;      /* 0x50 */
  __IO uint32_t         AHB2LPENR;      /* 0x54 */
  __IO uint32_t         AHB3LPENR;      /* 0x58 */
  uint32_t              reserved0x5c;   /* 0x5c */

  __IO uint32_t         APB1LPENR;      /* 0x60 */
  __IO uint32_t         APB2LPENR;      /* 0x64 */
  uint32_t              reserved0x68;   /* 0x68 */
  uint32_t              reserved0x6c;   /* 0x6c */

  __IO uint32_t         BDCR;           /* 0x70 */
#define RCC_BDCR_BDRST_SHIFT		16
#define RCC_BDCR_BDRST_MASK		(1 << (RCC_BDCR_BDRST_SHIFT))
#define RCC_BDCR_BDRST_NO		(0 << (RCC_BDCR_BDRST_SHIFT))
#define RCC_BDCR_BDRST_YES		(1 << (RCC_BDCR_BDRST_SHIFT))
#define RCC_BDCR_RTCEN_SHIFT		15
#define RCC_BDCR_RTCEN_MASK		(1 << (RCC_BDCR_RTCEN_SHIFT))
#define RCC_BDCR_RTCEN_NO		(0 << (RCC_BDCR_RTCEN_SHIFT))
#define RCC_BDCR_RTCEN_YES		(1 << (RCC_BDCR_RTCEN_SHIFT))
#define RCC_BDCR_RTCSELSEL_SHIFT        8
#define RCC_BDCR_RTCSELSEL_MASK         (3 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_NONE         (0 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_LSE          (1 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_LSI          (2 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_HSE          (3 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_SHIFT	3
#define RCC_BDCR_LSEDRVSEL_MASK		(3 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_LOWERCAP	(0 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_MEDLOWCAP	(1 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_MEDHIGHCAP	(2 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_HIGHERCAP	(3 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEBYP_SHIFT		2
#define RCC_BDCR_LSEBYP_MASK		(1 << (RCC_BDCR_LSEBYP_SHIFT))
#define RCC_BDCR_LSEBYP_NO		(0 << (RCC_BDCR_LSEBYP_SHIFT))
#define RCC_BDCR_LSEBYP_YES		(1 << (RCC_BDCR_LSEBYP_SHIFT))
#define RCC_BDCR_LSERDY_SHIFT		1
#define RCC_BDCR_LSERDY_MASK		(1 << (RCC_BDCR_LSERDY_SHIFT))
#define RCC_BDCR_LSERDY_NO		(0 << (RCC_BDCR_LSERDY_SHIFT))
#define RCC_BDCR_LSERDY_YES		(1 << (RCC_BDCR_EN_SHIFT))
#define RCC_BDCR_LSEON_SHIFT		0
#define RCC_BDCR_LSEON_MASK		(1 << (RCC_BDCR_LSEON_SHIFT))
#define RCC_BDCR_LSEON_NO		(0 << (RCC_BDCR_LSEON_SHIFT))
#define RCC_BDCR_LSEON_YES		(1 << (RCC_BDCR_LSEON_SHIFT))

