mfkiwl/McuDevelop/Devices/STM32F7/include/stm32f7Rcc.h
  __IO uint32_t                 CSR;    /* 0x74 */
#define RCC_CSR_LPWRRSTF_SHIFT		31
#define RCC_CSR_LPWRRSTF_MASK		(1 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_LPWRRSTF_NO		(0 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_LPWRRSTF_YES		(1 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_SHIFT		30
#define RCC_CSR_WWDGRSTF_MASK		(1 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_NO		(0 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_YES		(1 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_SHIFT		29
#define RCC_CSR_IWWGRSTF_MASK		(1 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_NO		(0 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_YES		(1 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_SHIFT		28
#define RCC_CSR_SFTRSTF_MASK		(1 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_NO		(0 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_YES		(1 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_PORRSTF_SHIFT		27
#define RCC_CSR_PORRSTF_MASK		(1 << (RCC_CSR_PORRSTF_SHIFT))
#define RCC_CSR_PORRSTF_NO		(0 << (RCC_CSR_PORRSTF_SHIFT))
#define RCC_CSR_PORRSTF_YES		(1 << (RCC_CSR_PORRSTF_SHIFT))
#define RCC_CSR_PINRSTF_SHIFT		26
#define RCC_CSR_PINRSTF_MASK		(1 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_PINRSTF_NO		(0 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_PINRSTF_YES		(1 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_SHIFT		25
#define RCC_CSR_OBLRSTF_MASK		(1 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_NO		(0 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_YES		(1 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_FWRSTF_SHIFT		24
#define RCC_CSR_FWRSTF_MASK		(1 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_FWRSTF_NO		(0 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_FWRSTF_YES		(1 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_RMVF_SHIFT		23
#define RCC_CSR_RMVF_MASK		(1 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_RMVF_NO		        (0 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_RMVF_YES		(1 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_LSIRDY_SHIFT		1
#define RCC_CSR_LSIRDY_MASK		(1 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSIRDY_NO		(0 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSIRDY_YES		(1 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSION_SHIFT		0
#define RCC_CSR_LSION_MASK		(1 << (RCC_CSR_LSION_SHIFT))
#define RCC_CSR_LSION_NO		(0 << (RCC_CSR_LSION_SHIFT))
#define RCC_CSR_LSION_YES		(1 << (RCC_CSR_LSION_SHIFT))

  uint32_t              reserved0x74;   /* 0x78 */
  uint32_t              reserved0x7c;   /* 0x7c */

  __IO uint32_t         SSCGR;          /* 0x80 */
  __IO uint32_t         PLLI2SCFGR;     /* 0x84 */
  uint32_t              reserved0x88;   /* 0x88 */
  __IO uint32_t         DCKCFGR;        /* 0x8c */
  __IO uint32_t         DCKCFGR2;       /* 0x90 */

} stm32Dev_RCC;



#define CALCPLL(reg, no, freqPllIn)      {                              \
  int div;                                                              \
  m = ( ((reg) & RCC_PLLCFGR_PLLM_MASK) >> RCC_PLLCFGR_PLLM_SHIFT);     \
  n = ( ((reg) & RCC_PLLCFGR_PLLN_MASK) >> RCC_PLLCFGR_PLLN_SHIFT);     \
  vco = (freqPllIn) / m * n;                                            \
  systemClk.pll ##no.vco = vco;                                         \
\
  /* div and store P, Q */ \
  div   = RCC_PTR->PLLCFGR & RCC_PLLCFGR_PLLP_MASK;     \
  div >>= RCC_PLLCFGR_PLLP_SHIFT;                       \
  div  += 1;                                            \
  systemClk.pll ##no.P = vco >> div;                    \
\
  div   = RCC_PTR->PLLCFGR & RCC_PLLCFGR_PLLQ_MASK;     \
  div >>= RCC_PLLCFGR_PLLQ_SHIFT;                       \
  systemClk.pll ##no.Q = vco / div;                     \
\
}


#define RccPll1Enable()                         \
{ \
  /* disable pll and wait till PLL is ready */ \
  RCC_PTR->CR &= ~RCC_CR_PLLON_MASK; \
  while(RCC_PTR->CR & RCC_CR_PLLON_MASK); \
 \
  /* enable PLL and wait becoming ready */ \
  RCC_PTR->CR |= RCC_CR_PLLON_YES; \
  while(!(RCC_PTR->CR & RCC_CR_PLLON_MASK)); \
}



#endif

